{"format": "graph-model", "generatedBy": "2.7.0", "convertedBy": "TensorFlow.js Converter v3.19.0", "signature": {"outputs": {"add_1": {"name": "add_1"}, "rnn/while/Exit_3": {"name": "rnn/while/Exit_3"}, "rnn/while/Exit_4": {"name": "rnn/while/Exit_4"}}}, "modelTopology": {"node": [{"name": "Variable", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "Variable_2", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "25"}]}}}}}, {"name": "Variable_3", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "25"}]}}}}}, {"name": "Placeholder", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "256"}]}}}}, {"name": "Placeholder_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "256"}]}}}}, {"name": "rnn/TensorArrayUnstack/range/start", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "rnn/TensorArrayUnstack/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "rnn/TensorArrayUnstack/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn/TensorArrayUnstack/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn/TensorArrayUnstack/range/delta", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "rnn/basic_lstm_cell/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1216"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "rnn/basic_lstm_cell/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}}}, {"name": "rnn/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "rnn/while/iteration_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "rnn/Maximum/x", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "Placeholder_2", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "960"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "rnn/concat", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "rnn/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn/strided_slice_1/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "rnn/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn/while/Enter_4", "op": "Enter", "input": ["Placeholder"], "attr": {"frame_name": {"s": "cm5uL3doaWxlL3doaWxlX2NvbnRleHQ="}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "rnn/while/Enter_3", "op": "Enter", "input": ["Placeholder_1"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "frame_name": {"s": "cm5uL3doaWxlL3doaWxlX2NvbnRleHQ="}, "parallel_iterations": {"i": "32"}}}, {"name": "rnn/while/basic_lstm_cell/MatMul/Enter", "op": "Enter", "input": ["rnn/basic_lstm_cell/kernel"], "attr": {"frame_name": {"s": "cm5uL3doaWxlL3doaWxlX2NvbnRleHQ="}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "rnn/while/basic_lstm_cell/BiasAdd/Enter", "op": "Enter", "input": ["rnn/basic_lstm_cell/bias"], "attr": {"is_constant": {"b": true}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "cm5uL3doaWxlL3doaWxlX2NvbnRleHQ="}}}, {"name": "rnn/while/Enter_1", "op": "Enter", "input": ["rnn/time"], "attr": {"frame_name": {"s": "cm5uL3doaWxlL3doaWxlX2NvbnRleHQ="}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_INT32"}, "is_constant": {"b": false}}}, {"name": "rnn/while/Enter", "op": "Enter", "input": ["rnn/while/iteration_counter"], "attr": {"T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "cm5uL3doaWxlL3doaWxlX2NvbnRleHQ="}, "is_constant": {"b": false}}}, {"name": "Reshape", "op": "Reshape", "input": ["Placeholder_2", "Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "rnn/while/Merge_4", "op": "Merge", "input": ["rnn/while/Enter_4", "rnn/while/NextIteration_4"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "rnn/while/Merge_3", "op": "Merge", "input": ["rnn/while/Enter_3", "rnn/while/NextIteration_3"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/rnn/basic_lstm_cell/kernel_enter", "op": "Const", "input": ["^rnn/while/basic_lstm_cell/MatMul/Enter"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1216"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/rnn/basic_lstm_cell/bias_enter", "op": "Const", "input": ["^rnn/while/basic_lstm_cell/BiasAdd/Enter"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "rnn/while/Merge_1", "op": "Merge", "input": ["rnn/while/Enter_1", "rnn/while/NextIteration_1"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "rnn/while/Merge", "op": "Merge", "input": ["rnn/while/Enter", "rnn/while/NextIteration"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "rnn/transpose", "op": "Transpose", "input": ["Reshape", "rnn/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "rnn/TensorArrayUnstack/Shape", "op": "Shape", "input": ["rnn/transpose"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "rnn/Shape_1", "op": "Shape", "input": ["rnn/transpose"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "rnn/TensorArrayUnstack/strided_slice", "op": "StridedSlice", "input": ["rnn/TensorArrayUnstack/Shape", "rnn/TensorArrayUnstack/strided_slice/stack", "rnn/TensorArrayUnstack/strided_slice/stack_1", "rnn/TensorArrayUnstack/strided_slice/stack_2"], "attr": {"end_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "rnn/strided_slice_1", "op": "StridedSlice", "input": ["rnn/Shape_1", "rnn/strided_slice_1/stack", "rnn/strided_slice_1/stack_1", "rnn/strided_slice_1/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "T": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}}}, {"name": "rnn/TensorArrayUnstack/range", "op": "Range", "input": ["rnn/TensorArrayUnstack/range/start", "rnn/TensorArrayUnstack/strided_slice", "rnn/TensorArrayUnstack/range/delta"], "attr": {"Tidx": {"type": "DT_INT32"}}}, {"name": "rnn/TensorArray_1", "op": "TensorArrayV3", "input": ["rnn/strided_slice_1"], "attr": {"clear_after_read": {"b": true}, "tensor_array_name": {"s": "cm5uL2R5bmFtaWNfcm5uL2lucHV0XzA="}, "identical_element_shapes": {"b": true}, "dynamic_size": {"b": false}, "dtype": {"type": "DT_FLOAT"}, "element_shape": {"shape": {"dim": [{"size": "-1"}, {"size": "960"}]}}}}, {"name": "rnn/while/Less/Enter", "op": "Enter", "input": ["rnn/strided_slice_1"], "attr": {"frame_name": {"s": "cm5uL3doaWxlL3doaWxlX2NvbnRleHQ="}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_INT32"}, "is_constant": {"b": true}}}, {"name": "rnn/Maximum", "op": "Maximum", "input": ["rnn/Maximum/x", "rnn/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "rnn/while/TensorArrayReadV3/Enter", "op": "Enter", "input": ["rnn/TensorArray_1"], "attr": {"frame_name": {"s": "cm5uL3doaWxlL3doaWxlX2NvbnRleHQ="}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": true}, "T": {"type": "DT_RESOURCE"}}}, {"name": "rnn/TensorArrayUnstack/TensorArrayScatter/TensorArrayScatterV3", "op": "TensorArrayScatterV3", "input": ["rnn/TensorArray_1", "rnn/TensorArrayUnstack/range", "rnn/transpose", "rnn/TensorArray_1:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnn/while/Less", "op": "Less", "input": ["rnn/while/Merge", "rnn/while/Less/Enter"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "rnn/Minimum", "op": "Minimum", "input": ["rnn/strided_slice_1", "rnn/Maximum"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "rnn/while/TensorArrayReadV3/Enter_1", "op": "Enter", "input": ["rnn/TensorArrayUnstack/TensorArrayScatter/TensorArrayScatterV3"], "attr": {"frame_name": {"s": "cm5uL3doaWxlL3doaWxlX2NvbnRleHQ="}, "is_constant": {"b": true}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "rnn/while/Less_1/Enter", "op": "Enter", "input": ["rnn/Minimum"], "attr": {"is_constant": {"b": true}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_INT32"}, "frame_name": {"s": "cm5uL3doaWxlL3doaWxlX2NvbnRleHQ="}}}, {"name": "rnn/while/Less_1", "op": "Less", "input": ["rnn/while/Merge_1", "rnn/while/Less_1/Enter"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "rnn/while/LogicalAnd", "op": "LogicalAnd", "input": ["rnn/while/Less", "rnn/while/Less_1"]}, {"name": "rnn/while/LoopCond", "op": "LoopCond", "input": ["rnn/while/LogicalAnd"]}, {"name": "rnn/while/Switch_3", "op": "Switch", "input": ["rnn/while/Merge_3", "rnn/while/LoopCond"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnn/while/Switch_1", "op": "Switch", "input": ["rnn/while/Merge_1", "rnn/while/LoopCond"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "rnn/while/Switch", "op": "Switch", "input": ["rnn/while/Merge", "rnn/while/LoopCond"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "rnn/while/Switch_4", "op": "Switch", "input": ["rnn/while/Merge_4", "rnn/while/LoopCond"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnn/while/Exit_3", "op": "Exit", "input": ["rnn/while/Switch_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnn/while/TensorArrayReadV3", "op": "TensorArrayReadV3", "input": ["rnn/while/TensorArrayReadV3/Enter", "rnn/while/Switch_1:1", "rnn/while/TensorArrayReadV3/Enter_1"], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"name": "rnn/while/Identity", "op": "Identity", "input": ["rnn/while/Switch:1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "rnn/while/Exit_4", "op": "Exit", "input": ["rnn/while/Switch_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnn/while/basic_lstm_cell/Const_1", "op": "Const", "input": ["^rnn/while/Identity"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "rnn/while/basic_lstm_cell/Const", "op": "Const", "input": ["^rnn/while/Identity"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn/while/basic_lstm_cell/concat/axis", "op": "Const", "input": ["^rnn/while/Identity"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn/while/add/y", "op": "Const", "input": ["^rnn/while/Identity"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "rnn/while/add_1/y", "op": "Const", "input": ["^rnn/while/Identity"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "MatMul", "op": "MatMul", "input": ["rnn/while/Exit_4", "Variable"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "rnn/while/basic_lstm_cell/concat", "op": "ConcatV2", "input": ["rnn/while/TensorArrayReadV3", "rnn/while/Switch_4:1", "rnn/while/basic_lstm_cell/concat/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "rnn/while/add", "op": "AddV2", "input": ["rnn/while/Identity", "rnn/while/add/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "rnn/while/add_1", "op": "AddV2", "input": ["rnn/while/Switch_1:1", "rnn/while/add_1/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "add", "op": "AddV2", "input": ["MatMul", "Variable_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnn/while/basic_lstm_cell/BiasAdd", "op": "_FusedMatMul", "input": ["rnn/while/basic_lstm_cell/concat", "ConstantFolding/rnn/basic_lstm_cell/kernel_enter", "ConstantFolding/rnn/basic_lstm_cell/bias_enter"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "rnn/while/NextIteration", "op": "NextIteration", "input": ["rnn/while/add"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "rnn/while/NextIteration_1", "op": "NextIteration", "input": ["rnn/while/add_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "Relu", "op": "Relu", "input": ["add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnn/while/basic_lstm_cell/split", "op": "Split", "input": ["rnn/while/basic_lstm_cell/Const", "rnn/while/basic_lstm_cell/BiasAdd"], "attr": {"num_split": {"i": "4"}, "T": {"type": "DT_FLOAT"}}}, {"name": "MatMul_1", "op": "MatMul", "input": ["Relu", "Variable_2"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "rnn/while/basic_lstm_cell/Sigmoid_1", "op": "Sigmoid", "input": ["rnn/while/basic_lstm_cell/split"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnn/while/basic_lstm_cell/Tanh", "op": "Tanh", "input": ["rnn/while/basic_lstm_cell/split:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnn/while/basic_lstm_cell/Add", "op": "AddV2", "input": ["rnn/while/basic_lstm_cell/split:2", "rnn/while/basic_lstm_cell/Const_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnn/while/basic_lstm_cell/Sigmoid_2", "op": "Sigmoid", "input": ["rnn/while/basic_lstm_cell/split:3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "add_1", "op": "AddV2", "input": ["MatMul_1", "Variable_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnn/while/basic_lstm_cell/Mul_1", "op": "Mul", "input": ["rnn/while/basic_lstm_cell/Sigmoid_1", "rnn/while/basic_lstm_cell/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnn/while/basic_lstm_cell/Sigmoid", "op": "Sigmoid", "input": ["rnn/while/basic_lstm_cell/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnn/while/basic_lstm_cell/Mul", "op": "Mul", "input": ["rnn/while/Switch_3:1", "rnn/while/basic_lstm_cell/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnn/while/basic_lstm_cell/Add_1", "op": "AddV2", "input": ["rnn/while/basic_lstm_cell/Mul", "rnn/while/basic_lstm_cell/Mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnn/while/NextIteration_3", "op": "NextIteration", "input": ["rnn/while/basic_lstm_cell/Add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnn/while/basic_lstm_cell/Tanh_1", "op": "Tanh", "input": ["rnn/while/basic_lstm_cell/Add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnn/while/basic_lstm_cell/Mul_2", "op": "Mul", "input": ["rnn/while/basic_lstm_cell/Tanh_1", "rnn/while/basic_lstm_cell/Sigmoid_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "rnn/while/NextIteration_4", "op": "NextIteration", "input": ["rnn/while/basic_lstm_cell/Mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {}}, "weightsManifest": [{"paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"], "weights": [{"name": "Variable", "shape": [256, 64], "dtype": "float32"}, {"name": "Variable_1", "shape": [64], "dtype": "float32"}, {"name": "Variable_2", "shape": [64, 25], "dtype": "float32"}, {"name": "Variable_3", "shape": [25], "dtype": "float32"}, {"name": "rnn/TensorArrayUnstack/range/start", "shape": [], "dtype": "int32"}, {"name": "rnn/TensorArrayUnstack/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "rnn/TensorArrayUnstack/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "rnn/TensorArrayUnstack/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "rnn/TensorArrayUnstack/range/delta", "shape": [], "dtype": "int32"}, {"name": "rnn/basic_lstm_cell/kernel", "shape": [1216, 1024], "dtype": "float32"}, {"name": "rnn/basic_lstm_cell/bias", "shape": [1024], "dtype": "float32"}, {"name": "rnn/time", "shape": [], "dtype": "int32"}, {"name": "rnn/while/iteration_counter", "shape": [], "dtype": "int32"}, {"name": "rnn/Maximum/x", "shape": [], "dtype": "int32"}, {"name": "Reshape/shape", "shape": [3], "dtype": "int32"}, {"name": "rnn/concat", "shape": [3], "dtype": "int32"}, {"name": "rnn/strided_slice_1/stack", "shape": [1], "dtype": "int32"}, {"name": "rnn/strided_slice_1/stack_1", "shape": [1], "dtype": "int32"}, {"name": "rnn/strided_slice_1/stack_2", "shape": [1], "dtype": "int32"}, {"name": "ConstantFolding/rnn/basic_lstm_cell/kernel_enter", "shape": [1216, 1024], "dtype": "float32"}, {"name": "ConstantFolding/rnn/basic_lstm_cell/bias_enter", "shape": [1024], "dtype": "float32"}, {"name": "rnn/while/basic_lstm_cell/Const_1", "shape": [], "dtype": "float32"}, {"name": "rnn/while/basic_lstm_cell/Const", "shape": [], "dtype": "int32"}, {"name": "rnn/while/basic_lstm_cell/concat/axis", "shape": [], "dtype": "int32"}, {"name": "rnn/while/add/y", "shape": [], "dtype": "int32"}, {"name": "rnn/while/add_1/y", "shape": [], "dtype": "int32"}]}]}